fortus documentation/RatingWebService/soaprequest_1.xml

<soap:Envelope 
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <Caller xmlns="http://www.compu-quote.com/RatingWebService/Version1">
      <Name>mycallingapp.dll</Name>
      <Version>1.0.1.54</Version>
      <Product>ThirdParty_Web</Product>
      <LineOfBusiness>AUTO</LineOfBusiness>
      <Province>ON</Province>
      <Language>EN</Language>
      <FortusVersion>
        <MajorVersion>5</MajorVersion>
        <MinorVersion>8</MinorVersion>
        <Build>2</Build>
      </FortusVersion>
    </Caller>
    <CQCredentials xmlns="http://www.compu-quote.com/RatingWebService/Version1">
      <UserName>Username1</UserName>
      <Password>UGFzc3dvcmQx</Password>
    </CQCredentials>
  </soap:Header>
  <soap:Body>
    <Quote xmlns="http://www.compu-quote.com/RatingWebService/Version1">
      <QuoteGUID>D726BAB974B747FBA24E321B0B9737F2</QuoteGUID>
      <QuoteIterationGUID>03F7A2ACCF9E481AB790Da34BA183EF3</QuoteIterationGUID>
      <xmlparam_FortusTransaction>
        <FortusTransaction Type="Automobile" xmlns="">
          <Province>ON</Province>
          <Renewal>NO</Renewal>
          <Carriers>
            <Carrier>DEMA</Carrier>
            <Carrier>DEMB</Carrier>
          </Carriers>
          <EffDate>20080731</EffDate>
          <CodeNames>
            <Auto>
              <QuoteInfo>
                <ID>Q3740625</ID>
                <AssumeMultiLine>N</AssumeMultiLine>
                <CoverageOverride>None</CoverageOverride>
                <Language>English</Language>
                <NoMVD>N</NoMVD>
                <Vehicle>
                  <ID>V3116128</ID>
                  <ABS>N</ABS>
                  <AirBag>None</AirBag>
                  <DistanceYearly>20000</DistanceYearly>
                  <Location>MISSISSAUGA</Location>
                  <LocationIndex>638</LocationIndex>
                  <PostalCode>L5M3C8</PostalCode>
                  <VehType>Private Passenger</VehType>
                  <VehUse>Pleasure</VehUse>
                  <VICCCode>8889</VICCCode>
                  <Year>2003</Year>
                  <MVDOverride>N</MVDOverride>
                  <AntitheftDevice>
                    <ID>AntitheftV3116128</ID>
                    <DeviceType>Monitored</DeviceType>
                    <Manufacturer>OnStar</Manufacturer>
                  </AntitheftDevice>
                  <Coverage>
                    <ID>V3116128-TPBI</ID>
                    <CSIOCode>TPBI</CSIOCode>
                    <Limit1>1000000</Limit1>
                  </Coverage>
                  <Coverage>
                    <ID>V3116128-UA</ID>
                    <CSIOCode>UA</CSIOCode>
                  </Coverage>
                  <Coverage>
                    <ID>V3116128-AB</ID>
                    <CSIOCode>AB</CSIOCode>
                  </Coverage>
                  <Coverage>
                    <ID>V3116128-TPDC</ID>
                    <CSIOCode>TPDC</CSIOCode>
                    <Deductible>0</Deductible>
                  </Coverage>
                  <Coverage>
                    <ID>V3116128-TPPD</ID>
                    <CSIOCode>TPPD</CSIOCode>
                    <Limit1>1000000</Limit1>
                  </Coverage>
                  <Coverage>
                    <ID>V3116128-COL</ID>
                    <CSIOCode>COL</CSIOCode>
                    <Deductible>500</Deductible>
                  </Coverage>
                  <Coverage>
                    <ID>V3116128-CMP</ID>
                    <CSIOCode>CMP</CSIOCode>
                    <Deductible>300</Deductible>
                  </Coverage>
                  <Coverage>
                    <ID>V3116128-44</ID>
                    <CSIOCode>44</CSIOCode>
                    <Limit1>1000000</Limit1>
                  </Coverage>
                </Vehicle>
                <DriverProfile>
                  <ID>D3121201</ID>
                  <Birthdate>19730914</Birthdate>
                  <DateContinuousInsurance>20051107</DateContinuousInsurance>
                  <DriverTraining>N</DriverTraining>
                  <Gender>M</Gender>
                  <RelationshipToApplicant>Insured</RelationshipToApplicant>
                  <MaritalStatus>S</MaritalStatus>
                  <Retired>N</Retired>
                  <OccupationCode>999</OccupationCode>
                  <DriverLicense>
                    <ID>License3142954</ID>
                    <Country>CA</Country>
                    <LicenseClass>G</LicenseClass>
                    <LicenseDate>19901101</LicenseDate>
                    <ProvinceState>ON</ProvinceState>
                  </DriverLicense>
                </DriverProfile>
                <VehLink>
                  <ID>LinkD3121201V3116128</ID>
                  <DriverID>D3121201</DriverID>
                  <VehicleID>V3116128</VehicleID>
                  <Link>Prn</Link>
                </VehLink>
              </QuoteInfo>
            </Auto>
          </CodeNames>
        </FortusTransaction>
      </xmlparam_FortusTransaction>
    </Quote>
  </soap:Body>
</soap:Envelope>